#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gke.null_resource.wait_for_cluster[0] will be destroyed
  - resource "null_resource" "wait_for_cluster" {
      - id       = "4835954860823922224" -> null
      - triggers = {
          - "name"       = "resume"
          - "project_id" = "badamscka"
        } -> null
    }

  # module.gke.module.gcloud_delete_default_kube_dns_configmap.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "3"
        }
    }

  # module.gke.module.gcloud_delete_default_kube_dns_configmap.random_id.cache will be created
  + resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.gke.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0] will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "2"
        }
    }

  # module.gke.module.gcloud_wait_for_cluster.random_id.cache will be created
  + resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 133, in provider "kubernetes":
 133:   config_context_cluster = "${module.gke.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

```

</details>

*Workflow: `terraform`, Action: `autotuneterraform-github-actions4`, Working Directory: `.`, Workspace: `staging`*
